app/Controllers/Home.php

SELECT *
FROM `notifikasi`
WHERE `status` = 'belum_dibaca'
---
    public function getNotifikasi()
    {
        $builder = $this->NotifikasiModel->where('status', 'belum_dibaca');

        // Filter notifikasi berdasarkan role
        if (session()->get('role') == 'user') {
            // User hanya melihat notifikasi yang ditujukan untuk mereka atau notifikasi umum
            $builder->groupStart()
                ->where('id_user', session()->get('id_user'))
                ->orWhere('id_user', null)
                ->groupEnd();
        }
        // Admin melihat semua notifikasi

        $notifikasi = $builder->findAll();